{
  "irVersion": "8",
  "producerName": "pytorch",
  "producerVersion": "2.6.0",
  "graph": {
    "node": [
      {
        "input": [
          "onnx::Gemm_0",
          "encoder.encoder.net.mlp.0.weight",
          "encoder.encoder.net.mlp.0.bias"
        ],
        "output": [
          "/encoder/encoder/net/mlp/mlp.0/Gemm_output_0"
        ],
        "name": "/encoder/encoder/net/mlp/mlp.0/Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "/encoder/encoder/net/mlp/mlp.0/Gemm_output_0"
        ],
        "output": [
          "/encoder/encoder/net/mlp/mlp.1/Tanh_output_0"
        ],
        "name": "/encoder/encoder/net/mlp/mlp.1/Tanh",
        "opType": "Tanh"
      },
      {
        "input": [
          "/encoder/encoder/net/mlp/mlp.1/Tanh_output_0",
          "pi.net.mlp.0.weight",
          "pi.net.mlp.0.bias"
        ],
        "output": [
          "/pi/net/mlp/mlp.0/Gemm_output_0"
        ],
        "name": "/pi/net/mlp/mlp.0/Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "/pi/net/mlp/mlp.0/Gemm_output_0"
        ],
        "output": [
          "/pi/Shape_output_0"
        ],
        "name": "/pi/Shape",
        "opType": "Shape"
      },
      {
        "output": [
          "/pi/Constant_output_0"
        ],
        "name": "/pi/Constant",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 7,
              "rawData": "//////////8="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/pi/Shape_output_0",
          "/pi/Constant_output_0"
        ],
        "output": [
          "/pi/Gather_output_0"
        ],
        "name": "/pi/Gather",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "0",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "/pi/Constant_1_output_0"
        ],
        "name": "/pi/Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 7,
              "rawData": "AAAAAAAAAAA="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "/pi/Constant_2_output_0"
        ],
        "name": "/pi/Constant_2",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 7,
              "rawData": "AQAAAAAAAAA="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/pi/Gather_output_0",
          "/pi/Constant_2_output_0"
        ],
        "output": [
          "/pi/Add_output_0"
        ],
        "name": "/pi/Add",
        "opType": "Add"
      },
      {
        "output": [
          "/pi/Constant_3_output_0"
        ],
        "name": "/pi/Constant_3",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 7,
              "rawData": "AgAAAAAAAAA="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/pi/Add_output_0",
          "/pi/Constant_3_output_0"
        ],
        "output": [
          "/pi/Div_output_0"
        ],
        "name": "/pi/Div",
        "opType": "Div"
      },
      {
        "output": [
          "/pi/Constant_4_output_0"
        ],
        "name": "/pi/Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 7,
              "rawData": "AQAAAAAAAAA="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/pi/Div_output_0",
          "/pi/Constant_4_output_0"
        ],
        "output": [
          "/pi/Mul_output_0"
        ],
        "name": "/pi/Mul",
        "opType": "Mul"
      },
      {
        "input": [
          "/pi/net/mlp/mlp.0/Gemm_output_0",
          "/pi/Constant_1_output_0",
          "/pi/Mul_output_0",
          "/pi/Constant_output_0"
        ],
        "output": [
          "/pi/Slice_output_0"
        ],
        "name": "/pi/Slice",
        "opType": "Slice"
      },
      {
        "output": [
          "/pi/Constant_5_output_0"
        ],
        "name": "/pi/Constant_5",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 7,
              "rawData": "AgAAAAAAAAA="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/pi/Div_output_0",
          "/pi/Constant_5_output_0"
        ],
        "output": [
          "/pi/Mul_1_output_0"
        ],
        "name": "/pi/Mul_1",
        "opType": "Mul"
      },
      {
        "input": [
          "/pi/net/mlp/mlp.0/Gemm_output_0",
          "/pi/Mul_output_0",
          "/pi/Mul_1_output_0",
          "/pi/Constant_output_0"
        ],
        "output": [
          "/pi/Slice_1_output_0"
        ],
        "name": "/pi/Slice_1",
        "opType": "Slice"
      },
      {
        "input": [
          "/pi/Slice_1_output_0",
          "onnx::Max_34"
        ],
        "output": [
          "/pi/Max_output_0"
        ],
        "name": "/pi/Max",
        "opType": "Max"
      },
      {
        "input": [
          "/pi/Max_output_0",
          "onnx::Min_35"
        ],
        "output": [
          "/pi/Min_output_0"
        ],
        "name": "/pi/Min",
        "opType": "Min"
      },
      {
        "input": [
          "/pi/Slice_output_0",
          "/pi/Min_output_0"
        ],
        "output": [
          "30"
        ],
        "name": "/pi/Concat",
        "opType": "Concat",
        "attribute": [
          {
            "name": "axis",
            "i": "-1",
            "type": "INT"
          }
        ]
      }
    ],
    "name": "main_graph",
    "initializer": [
      {
        "dims": [
          "32",
          "5"
        ],
        "dataType": 1,
        "name": "encoder.encoder.net.mlp.0.weight",
        "rawData": "n3a6Pp8Bxz7HSyq+xMK+PpLKxb7lzqq9BOhRPvtKhb1BxUq++ZGRvXyQu77Dfsw9T4Govgl8NT9iNBY/8ApivVDIvb7hYhW+TVk9Pj6dB78cvn4+J5QTvmfVp73a5uU+uPUhvQ1txT1Vmsw9GswZPSkQFz8qmZa+wbRmvjVdyT2pJtc+eMmqPgcU1DlPzis+7kykvPN4Gj7pC1u+ukdgv4LMN75RD/48hi+suj8FeT7nV0W+G7w8PoqJlz5+ikY9fUuwvpqPzb5JgQu+bb7avpDYBL8L0di+bvWQPpxVVb6iMoW9Q4rRPpMkzL4NpsW+/PqMPpOJlL6qooy9+dUCPhW+Lb4yPwM9wcVaPvjBE716Gfy9D8jPvtKu+z1UfQA96idnvts1lz4yNOe+p2TEvrF+O757eZU+eiyBPvO9R74EkJQ+3ThnPt1KBz6hYBS/QzEsvrCwNbzeuHK+ppXEPArflL4ejNU+4C9MvuyOOz6eFfo9OUyqPnc9nryPZxs9ftKvPkfupL1ETbO+uT2LvsbQ1Dswbnk+RgHBvuy6kD6/JN09Wj2PvmwTWD6Yw5+9E6SFvjFGlL4lcHW+XQulPvRkK75PxN6++kVrPtxEiL69HKy+2cXEPnjt0r57Ae496k4sPiVvEL0EFmO+uJktvgMRLr88o4U+kIquPsy83T4ufMa9k5PLPaW8R75aFlG+wbs/vXxN+j4FR2c++YydPZo/PL5w2Gq+lQrqve+Wrr7DAqw+VQCQPmtlsL7XUqm6+Kf3vtwrs767kQo97oSPPWCNSj4bUYK89DwxPps9gj43dnA+QVeCvrMm0j1K/Bk+CgkLvzGC07ycpvs+F7CuPg=="
      },
      {
        "dims": [
          "32"
        ],
        "dataType": 1,
        "name": "encoder.encoder.net.mlp.0.bias",
        "rawData": "Np0iv3jPGD+61uc+Lkhou/OhJ70fx7o+YHZRvuDSBzx0ioS+R/8rv3IGw70cSBe/VhYJv1oiA7+2mEO+ON7fvi8UEr+9Bfw+2R6fvm3XKb+UukY+SsF8Pi56Bb/3E6G+Ia2MvQ+BqjzXF0O/ZZdbPvBOXz5qR9a+Fd7qPtlKKj8="
      },
      {
        "dims": [
          "4",
          "32"
        ],
        "dataType": 1,
        "name": "pi.net.mlp.0.weight",
        "rawData": "DEXWPbKyAb6g7lo+gUNWvKyWOz5j0JI+RkHcvT7rS74EUIO9RFFgvoORJD01dfi9hp5Eu1Ywar19uyU+OAwtPkO46b2I2iW+B0PzPSZCkj20p6A6mBQlvq5ldL51zey7UWX1PfGeEz1FfZI9MdekvYLHEr7FiE49mm13vp9Gdr3vyCm+OBsBPj7RtjvGS/W9kCDdvcsphb7mfEW9XRdTvq3FS76NMr+8UJ2UPsZBtrsG9Uq9t5bgPFr5dT0EjD++1kK9vMRlMz6zZVA9acrOPeTKDj77RWQ9RXKJPk4dvrx0OT+9X1YpPl6Uyb1o7aS9u6w4vpNgo70HqwQ+i+2Cvbyozz4JAR29BzMqvip8gb38R5y8eFYSPuTTJb37zvE+QD+vPgEtEz9b7gI+RufNvLzBkD3l3o8+8ZEYPU5jCj5FfJs+Sy+bvgCJRb7wv4U+j/YPvermob0/gRm9fbV7voekUT56+iO+8frXPfuA7j1BIOg+nOLdvQ5aIL7ZNlW+j9oHPu13Cj3x0qu+DAbTPFf8tL73ZIi+KZAZvhpMED/zsWm9hl8ZP3O3XD5Ewas9aDIyPHTt9z7Ahik+7ssNPvVlCj8owKG+B0QjvhK1Fj/E99i+Dh0SP+AEMD6z+ow+nVT1PnVk2b2DR8q+VZWZPg01jT5fWn49sSZAvt+fB78="
      },
      {
        "dims": [
          "4"
        ],
        "dataType": 1,
        "name": "pi.net.mlp.0.bias",
        "rawData": "rwbvPdGrX71uoZu+YUD6vg=="
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 1,
        "name": "onnx::Max_34",
        "rawData": "AACgwQ=="
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 1,
        "name": "onnx::Min_35",
        "rawData": "AACgQQ=="
      }
    ],
    "input": [
      {
        "name": "onnx::Gemm_0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "5"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "30",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "version": "17"
    }
  ]
}